posts/2015-01-13-the-third-sunday-after-pentecost.org
#+date: <2015-01-13>
#+filetags: prayer religion
#+title: The Third Sunday After Pentecost

God of grace,

We live in a word of concrete barricades, wooden fences, and stone walls that we have built to protect, separate, control, and hide; some hastily thrown up in hours, others carefully built in weeks or months.

Other walls, though, are constructed over a lifetime, and are just as real and just as effective—downcast eyes, hostile stares, and stony silence—walls constructed to prevent the pain of rejection, or to keep others out of our comfortable lives.

Yet we dream of a place where the barricades can be taken down, a place without fear, hunger, want, or need; a place with neither revenge nor retribution, for there are no wrongs to made right; a world filled with peace, justice, love, and grace—not another world, but this world, transformed and redeemed.

How can we build such a world when we only know how to build walls?

Lord have mercy on us.

/Amen/




#+begin_tagline
Tagged: prayer religion
#+end_tagline
