docs/posts/2015-01-13-the-third-sunday-after-pentecost.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Third Sunday After Pentecost</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Third Sunday After Pentecost</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
God of grace,
</p>

<p>
We live in a word of concrete barricades, wooden fences, and stone walls that we have built to protect, separate, control, and hide; some hastily thrown up in hours, others carefully built in weeks or months.
</p>

<p>
Other walls, though, are constructed over a lifetime, and are just as real and just as effective—downcast eyes, hostile stares, and stony silence—walls constructed to prevent the pain of rejection, or to keep others out of our comfortable lives.
</p>

<p>
Yet we dream of a place where the barricades can be taken down, a place without fear, hunger, want, or need; a place with neither revenge nor retribution, for there are no wrongs to made right; a world filled with peace, justice, love, and grace—not another world, but this world, transformed and redeemed.
</p>

<p>
How can we build such a world when we only know how to build walls?
</p>

<p>
Lord have mercy on us.
</p>

<p>
<i>Amen</i>
</p>




<div class="tagline" id="org6e310da">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
